<?php
return [
    'email' => [
        'required' => 'Поле електронної пошти є обов’язковим.',
        'string'   => 'Електронна пошта повинна бути рядком.',
        'email'    => 'Будь ласка, введіть дійсну електронну адресу.',
        'max'      => 'Електронна пошта не може перевищувати :max символів.',
    ],
    
    'password' => [
        'required' => 'Поле пароля є обов’язковим.',
        'string'   => 'Пароль повинен бути рядком.',
    ],
    
    'captcha' => [
        'required' => 'Будь ласка, введіть капчу.',
    ],
];
