<?php
return [

    'name' => [
        'required' => 'Поле ім’я є обов’язковим.',
        'string'   => 'Ім’я повинно бути рядком.',
        'max'      => 'Ім’я не може перевищувати :max символів.',
    ],

    'subject' => [
        'required' => 'Поле тема є обов’язковим.',
        'string'   => 'Тема повинна бути рядком.',
        'max'      => 'Тема не може перевищувати :max символів.',
    ],

    'email' => [
        'required' => 'Поле електронної пошти є обов’язковим.',
        'email'    => 'Будь ласка, введіть дійсну електронну адресу.',
    ],

    'message' => [
        'required' => 'Поле повідомлення є обов’язковим.',
        'string'   => 'Повідомлення повинно бути рядком.',
        'min'      => 'Повідомлення повинно містити щонайменше :min символів.',
        'max'      => 'Повідомлення не може перевищувати :max символів.',
    ],

    'captcha' => [
        'required' => 'Будь ласка, пройдіть перевірку капчі.',
    ],
];
