<?php
return [
    'search' => [
        'string' => 'Пошуковий запит повинен бути рядком.',
        'min'    => 'Пошуковий запит повинен містити щонайменше :min символів.',
    ],

    'title' => [
        'string' => 'Назва повинна бути дійсним рядком.',
    ],

    'content' => [
        'string' => 'Вміст повинен бути дійсним рядком.',
    ],

    'category' => [
        'string' => 'Категорія повинна бути дійсним рядком.',
    ],

    'tag' => [
        'array'    => 'Теги повинні бути надані у вигляді масиву.',
        '*.string' => 'Кожен тег повинен бути дійсним рядком.',
    ],

    'author' => [
        'string' => 'Поле автора повинно бути дійсним рядком.',
    ],

    'sort_by' => [
        'string' => 'Поле сортування повинно бути рядком.',
        'in'     => 'Вибраний параметр сортування недійсний.',
    ],

    'sort_dir' => [
        'string' => 'Напрям сортування повинен бути рядком.',
        'in'     => 'Вибраний напрям сортування недійсний.',
    ],
];
