<?php
return [
    // Іконка
    'icon' => [
        'required' => 'Поле іконки є обов’язковим.',
        'string'   => 'Іконка повинна бути рядком.',
        'min'      => 'Іконка повинна містити щонайменше :min символів.',
        'max'      => 'Іконка не може перевищувати :max символів.',
    ],

    // Назва
    'title' => [
        'required' => 'Поле назви є обов’язковим.',
        'string'   => 'Назва повинна бути рядком.',
        'min'      => 'Назва повинна містити щонайменше :min символів.',
        'max'      => 'Назва не може перевищувати :max символів.',
    ],

    // URL
    'url' => [
        'required' => 'Поле URL є обов’язковим.',
        'string'   => 'URL повинен бути рядком.',
        'min'      => 'URL повинен містити щонайменше :min символів.',
        'max'      => 'URL не може перевищувати :max символів.',
        'url'      => 'Невірний формат URL.',
    ],
];
