<?php
return [
    'current_password' => [
        'required'          => 'Будь ласка, введіть ваш поточний пароль.',
        'current_password'  => 'Введений поточний пароль невірний.',
    ],

    'password' => [
        'required'      => 'Поле нового пароля є обов’язковим.',
        'string'        => 'Пароль повинен бути рядком.',
        'max'           => 'Пароль не може перевищувати :max символів.',
        'confirmed'     => 'Підтвердження пароля не співпадає.',
        'min'           => 'Пароль повинен містити щонайменше :min символів.',
        'letters'       => 'Пароль повинен містити щонайменше одну літеру.',
        'mixed'         => 'Пароль повинен містити великі та малі літери.',
        'numbers'       => 'Пароль повинен містити щонайменше одну цифру.',
        'symbols'       => 'Пароль повинен містити щонайменше один спеціальний символ.',
        'uncompromised' => 'Цей пароль з’являвся у витоку даних. Будь ласка, оберіть інший пароль.',
    ],
];
