<?php 
return [
    'avatar' => [
        'image' => 'Аватар повинен бути зображенням (jpg, jpeg, png, webp).',
        'max'   => 'Розмір аватара не може перевищувати :max кілобайт.',
    ],

    'name' => [
        'required' => 'Поле імені є обов’язковим.',
        'string'   => 'Ім’я повинно бути рядком.',
        'max'      => 'Ім’я не може перевищувати :max символів.',
        'regex'    => 'Ім’я може містити лише англійські літери.',
    ],

    'surname' => [
        'string' => 'Прізвище повинно бути рядком.',
        'max'    => 'Прізвище не може перевищувати :max символів.',
        'regex'  => 'Прізвище може містити лише англійські літери.',
    ],

    'job_title' => [
        'string' => 'Назва посади повинна бути рядком.',
        'max'    => 'Назва посади не може перевищувати :max символів.',
    ],

    'address' => [
        'string' => 'Адреса повинна бути рядком.',
        'max'    => 'Адреса не може перевищувати :max символів.',
    ],

    'about_myself' => [
        'string' => 'Розділ "Про себе" повинен бути рядком.',
        'max'    => 'Розділ "Про себе" не може перевищувати :max символів.',
    ],

    'website' => [
        'url' => 'Невірний формат веб-сайту.',
        'max' => 'Веб-сайт не може перевищувати :max символів.',
    ],

    'github' => [
        'url' => 'Невірний формат URL GitHub.',
        'max' => 'URL GitHub не може перевищувати :max символів.',
    ],

    'linkedin' => [
        'url' => 'Невірний формат URL LinkedIn.',
        'max' => 'URL LinkedIn не може перевищувати :max символів.',
    ],
];
