<?php
return [
    'token' => [
        'required' => 'Необхідний токен для скидання пароля.',
    ],

    'email' => [
        'required' => 'Поле електронної пошти є обов’язковим.',
        'string'   => 'Електронна пошта повинна бути рядком.',
        'email'    => 'Будь ласка, введіть дійсну електронну адресу.',
        'max'      => 'Електронна пошта не може перевищувати :max символів.',
    ],

    'password' => [
        'required'   => 'Поле пароля є обов’язковим.',
        'string'     => 'Пароль повинен бути рядком.',
        'min'        => 'Пароль повинен містити щонайменше :min символів.',
        'max'        => 'Пароль не може перевищувати :max символів.',
        'confirmed'  => 'Підтвердження пароля не збігається.',
    ],
];
