<?php
return [
    'title' => [
        'required' => 'Поле назви ролі є обов’язковим.',
        'string'   => 'Назва ролі повинна бути рядком.',
        'min'      => 'Назва ролі повинна містити щонайменше :min символів.',
        'max'      => 'Назва ролі не може перевищувати :max символів.',
        'unique'   => 'Роль з такою назвою вже існує.',
    ],

    'permissions' => [
        'array'     => 'Поле прав доступу повинно бути масивом.',
        '*.integer' => 'Кожен ID права доступу повинен бути числом.',
        '*.exists'  => 'Один або декілька вибраних прав доступу не існують.',
    ],
];
