<?php
return [
    'comments' => [
        'enabled' => [
            'boolean' => 'Параметр "Дозволити коментарі" має бути булевим значенням (true або false).',
        ],
        'auto_approve' => [
            'boolean' => 'Параметр автоматичного схвалення повинен бути істинним або хибним.',
        ],

        'filter_words' => [
            'string' => 'Список слів для фільтрації повинен бути рядком.',
        ],

        'links_policy' => [
            'required' => 'Поле політики посилань є обов’язковим.',
            'in'       => 'Вибрана політика посилань недійсна.',
        ],
    ],
];
