<?php
return [
    'comments' => [
        'enabled' => [
            'boolean' => 'Параметр "Дозволити коментарі" має бути булевим значенням (true або false).',
        ],
        'auto_approve' => [
            'boolean' => 'Параметр автоматичного схвалення повинен бути істинним або хибним.',
        ],

        'filter_words' => [
            'string' => 'Список слів для фільтрації повинен бути рядком.',
        ],

        'links_policy' => [
            'required' => 'Поле політики посилань є обов’язковим.',
            'in'       => 'Вибрана політика посилань недійсна.',
        ],
    ],


    'user' => [
        'user_default_status' => [
            'string' => 'Статус користувача має бути текстовим значенням.',
        ],
        'user_default_role' => [
            'string' => 'Роль користувача має бути текстовим значенням.',
        ],
        'user_require_email_verification' => [
            'boolean' => 'Поле підтвердження електронної пошти повинно бути булевим значенням (true або false).',
        ],
    ],
    'site' => [
        'name' => [
            'required' => 'Назва сайту є обов’язковою.',
            'string' => 'Назва сайту має бути рядком.',
            'max' => 'Назва сайту не може перевищувати :max символів.',
        ],
        'description' => [
            'string' => 'Опис сайту має бути рядком.',
            'max' => 'Опис сайту не може перевищувати :max символів.',
        ],
        'keywords' => [
            'string' => 'Ключові слова мають бути рядком.',
            'max' => 'Ключові слова не можуть перевищувати :max символів.',
        ],
        'favicon' => [
            'image' => 'Файл favicon має бути зображенням.',
            'mimes' => 'Файл favicon повинен бути у форматі: png, ico, jpg, jpeg або svg.',
            'max' => 'Файл favicon не може перевищувати :max КБ.',
        ],
    ],
];
