<?php
return [
    'avatar' => [
        'image' => 'Аватар повинен бути файлом зображення (jpg, jpeg, png, webp).',
        'max'   => 'Розмір аватара не може перевищувати :max кілобайт.',
    ],

    'name' => [
        'required' => 'Поле імені обов’язкове.',
        'string'   => 'Ім’я повинно бути рядком.',
        'max'      => 'Ім’я не може перевищувати :max символів.',
        'regex'    => 'Ім’я може містити лише літери латиниці.',
    ],

    'surname' => [
        'string' => 'Прізвище повинно бути рядком.',
        'max'    => 'Прізвище не може перевищувати :max символів.',
        'regex'  => 'Прізвище може містити лише літери латиниці.',
    ],

    'job_title' => [
        'string' => 'Посада повинна бути рядком.',
        'max'    => 'Посада не може перевищувати :max символів.',
    ],

    'address' => [
        'string' => 'Адреса повинна бути рядком.',
        'max'    => 'Адреса не може перевищувати :max символів.',
    ],

    'about_myself' => [
        'string' => 'Розділ "Про себе" повинен бути рядком.',
        'max'    => 'Розділ "Про себе" не може перевищувати :max символів.',
    ],

    'website' => [
        'url' => 'Формат вебсайту недійсний.',
        'max' => 'Вебсайт не може перевищувати :max символів.',
    ],

    'github' => [
        'url' => 'Формат URL GitHub недійсний.',
        'max' => 'URL GitHub не може перевищувати :max символів.',
    ],

    'linkedin' => [
        'url' => 'Формат URL LinkedIn недійсний.',
        'max' => 'URL LinkedIn не може перевищувати :max символів.',
    ],
];
