<?php

return [

    'title' => 'Підтвердження електронної пошти',
    'description' => 'Будь ласка, введіть вашу електронну пошту, щоб ми могли повторно надіслати посилання для підтвердження.',

    'buttons' => [
        'submit' => 'Надіслати посилання повторно',
    ],

    'fields' => [],

    'placeholder' => [],

    'messages' => [
        'link_sent'               => 'Посилання для підтвердження надіслано на вашу електронну пошту.',
        'link_generic'            => 'Якщо ваша електронна пошта зареєстрована, посилання для підтвердження було надіслано.',
        'unexpected_error'        => 'Сталася непередбачена помилка. Будь ласка, спробуйте ще раз.',

        'invalid_or_expired_link' => 'Посилання для підтвердження недійсне або термін дії минув.',
        'email_already_verified'  => 'Ваша електронна пошта вже підтверджена.',
        'email_verified_success'  => 'Ваша електронна пошта успішно підтверджена.',
    ],
];
