<?php

return [
    'delete' => [
        'admin' => 'Видалення користувача з цього акаунту заборонено.',
        'self'  => 'Видалення самого себе заборонено.',
        'failed' => 'Не вдалося видалити користувача.',
    ],
     'update' => [
        'failed' => 'Не вдалося оновити користувача.',
    ],
    'deactivate' => [
        'last_active' => 'Неможливо деактивувати останнього активного користувача.',
    ],
    'email' => [
        'not_verified' => 'Адреса електронної пошти не підтверджена.',
    ],
];
