<?php
return [
    'title' => 'Загальні',
    'fields' => [
        'name'        => 'Назва сайту',
        'description' => 'Опис сайту',
        'keywords'    => 'Мета ключові слова',
        'favicon'     => 'Favicon',

        'site_email' => 'Електронна пошта сайту',
        'site_phone' => 'Телефон сайту',
        'site_address' => 'Адреса сайту',
    ],

    'placeholder' => [
        'name'        => 'Введіть назву вашого сайту (наприклад, Моя Компанія)',
        'description' => 'Коротко опишіть призначення або контент сайту',
        'keywords'    => 'Введіть мета ключові слова через кому (наприклад: блог, технології, новини)',
        'favicon'     => 'Завантажте маленьку іконку (16x16 або 32x32)',
        'site_email' => 'Введіть основну контактну електронну адресу (наприклад, admin@example.com)',
        'site_phone' => 'Введіть контактний номер телефону (наприклад, +1 234 567 890)',
        'site_address' => 'Введіть фізичну або поштову адресу',
    ],
];
