<?php
return [
    'title' => 'Загальні',
    'fields' => [
        'name'        => 'Назва сайту',
        'description' => 'Опис сайту',
        'keywords'    => 'Мета ключові слова',
        'favicon'     => 'Favicon',
    ],

    'placeholder' => [
        'name'        => 'Введіть назву вашого сайту (наприклад, Моя Компанія)',
        'description' => 'Коротко опишіть призначення або контент сайту',
        'keywords'    => 'Введіть мета ключові слова через кому (наприклад: блог, технології, новини)',
        'favicon'     => 'Завантажте маленьку іконку (16x16 або 32x32)',
    ],
];
