<?php

return [
    'title' => 'Зв’яжіться з нами',
    'description' => 'Ми будемо раді вас почути. Заповніть форму нижче, і ми незабаром зв’яжемося з вами.',

    'fields' => [
        'subject' => 'Тема',
        'message' => 'Повідомлення',
    ],

    'placeholder' => [
        'subject' => 'Введіть тему вашого повідомлення',
        'message' => 'Введіть текст повідомлення',
    ],

    'buttons' => [
        'submit' => 'Надіслати повідомлення',
    ],

    'messages' => [
        'send_message' => 'Ваше повідомлення успішно надіслано. Ми зв’яжемося з вами найближчим часом.',
    ],
];
