<?php

return [
    'title' => 'Увійти',
    'description' => 'Будь ласка, введіть ваш email та пароль, щоб отримати доступ до облікового запису.',
    'submit' => 'Увійти',
    'remember_me' => 'Запам’ятати мене',
    'links' => [
        'forgot_password' => 'Забули пароль?',
        'dont_have_account' => 'Ще немає облікового запису?',
        'register_now' => 'Створити зараз',
    ],

    'messages' => [
        'account_inactive' => 'Ваш акаунт неактивний. Зверніться до адміністратора.',
        'auth_failed' => 'Невірна електронна адреса або пароль.',
    ]
];
