<?php

return [
    'title' => 'Реєстрація',
    'description' => 'Будь ласка, заповніть форму, щоб створити обліковий запис.',
    'submit' => 'Зареєструватися',

    'links' => [
        'already_have_an_account' => 'Вже маєте обліковий запис?',
        'login'                   => 'Увійти',
    ],
    'messages' => [
        'register' => 'Ваш акаунт успішно створено. Перевірте пошту для підтвердження акаунта.',
        'register_failed' => 'Виникла помилка при створенні акаунта. Спробуйте ще раз.',
    ],
];
