<?php

return [
    'title' => 'Підтвердження email',
    'description'  => 'Будь ласка, введіть ваш email, щоб ми могли повторно надіслати посилання для підтвердження.',
    'submit' => 'Надіслати ще раз',

    'messages' => [
        'link_sent' => 'Посилання для підтвердження надіслано на ваш email.',
        'link_generic' => 'Якщо ваш email зареєстровано, посилання для підтвердження надіслано.',
        'unexpected_error' => 'Виникла непередбачена помилка. Спробуйте ще раз.',
        
        'invalid_or_expired_link' => 'Посилання для підтвердження недійсне або термін його дії закінчився.',
        'email_already_verified' => 'Ваш email вже підтверджено.',
        'email_verified_success' => 'Ваш email успішно підтверджено.',
    ],
];
