<?php

return [
    'title' => 'Категорії',

    'fields' => [
        'id'        => 'ID',
        'title'     => 'Назва',
        'count'     => 'Кількість публікацій',
        'created_at' => 'Створено',
        'posts'     => 'Публікації',
    ],

    'placeholder' => [
        'title' => 'Введіть заголовок',
    ],

    'messages' => [
        'create' => 'Категорію ":title" успішно створено',
        'edit' => 'Категорію ":title" успішно оновлено',
        'delete' => 'Категорію ":title" успішно видалено',
    ],

    'actions' => [
        'create' => 'Додати категорію',
        'edit'   => 'Редагувати категорію',
        'delete' => 'Видалити категорію',
    ],
];
