<?php

return [
    'title' => 'Коментарі',

    'fields' => [
        'id' => 'ID',
        'body' => 'Текст коментаря',
        'author' => 'Автор',
        'post' => 'Публікація',
        'status'=>'Статус',
        'created_at' => 'Створено',
    ],


       'messages' => [
        'edit'   => 'Коментар ":body" успішно оновлено',
        'delete' => 'Коментар ":body" успішно видалено',
    ],
        'actions' => [
        'edit'   => 'Редагувати коментар',
        'delete' => 'Видалити коментар',
    ],
];
