<?php 

return [
    'title' => 'Повідомлення',

    'fields' => [
        'id'         => 'ID',
        'name'       => 'Ім’я',
        'subject'    => 'Тема',
        'email'      => 'Електронна пошта',
        'created_at' => 'Створено',
    ],

    'mail' => [
        'from'             => 'Відправник',
        'to'               => 'Отримувач',
        'subject'          => 'Тема',
        'message'          => 'Повідомлення',
        'placeholder'      => 'Напишіть вашу відповідь тут...',
        'original_message' => 'Оригінальне повідомлення',
    ],
    
      'messages' => [
        'send' => 'Відповідь успішно надіслано.',
    ],
];
