<?php

return [
    'title' => 'Соціальні мережі',

    'fields' => [
        'id'         => 'ID',
        'icon'       => 'Іконка',
        'title'      => 'Назва',
        'url'        => 'Посилання',
        'created_at' => 'Створено',
    ],

    'placeholder' => [
        'icon'  => 'Приклад: fa-brands fa-github',
        'title' => 'Введіть назву',
        'url'   => 'Введіть URL-посилання',
    ],

    'messages' => [
        'create' => 'Соціальну мережу ":title" успішно створено',
        'edit' => 'Соціальну мережу ":title" успішно оновлено',
        'delete' => 'Соціальну мережу ":title" успішно видалено',
    ],

    'actions' => [
        'create' => 'Додати соціальну мережу',
        'edit'   => 'Редагувати соціальну мережу',
        'delete' => 'Видалити соціальну мережу',
    ],
];
