<?php

return [
    'title' => 'Дозволи',
    
    'post' => [
        'label'  => 'Пости',
        'view'   => 'Перегляд постів',
        'create' => 'Створення постів',
        'update' => 'Редагування постів',
        'delete' => 'Видалення постів',
    ],

    'category' => [
        'label'  => 'Категорії',
        'view'   => 'Перегляд категорій',
        'create' => 'Створення категорій',
        'update' => 'Редагування категорій',
        'delete' => 'Видалення категорій',
    ],

    'tag' => [
        'label'  => 'Теги',
        'view'   => 'Перегляд тегів',
        'create' => 'Створення тегів',
        'update' => 'Редагування тегів',
        'delete' => 'Видалення тегів',
    ],

    'comment' => [
        'label'  => 'Коментарі',
        'view'   => 'Перегляд коментарів',
        'create' => 'Створення коментарів',
        'update' => 'Редагування коментарів',
        'delete' => 'Видалення коментарів',
    ],

    'user' => [
        'label'  => 'Користувачі',
        'view'   => 'Перегляд користувачів',
        'create' => 'Створення користувачів',
        'update' => 'Редагування користувачів',
        'delete' => 'Видалення користувачів',
    ],

    'role' => [
        'label'  => 'Ролі',
        'view'   => 'Перегляд ролей',
        'create' => 'Створення ролей',
        'update' => 'Редагування ролей',
        'delete' => 'Видалення ролей',
    ],

    'contact' => [
        'label'  => 'Контакти',
        'view'   => 'Перегляд контактів',
        'update' => 'Редагування контактів',
    ],

    'log' => [
        'label'  => 'Логи',
        'view' => 'Перегляд логів',
    ],

    'setting' => [
        'label'  => 'Налаштування',
        'access' => 'Доступ до налаштувань',
        'view'   => 'Перегляд налаштувань',
        'create' => 'Створення налаштувань',
        'update' => 'Редагування налаштувань',
        'delete' => 'Видалення налаштувань',
    ],
];
