<?php

return [
    'title' => 'Ролі',

    'fields' => [
        'id'        => 'ID',
        'title'     => 'Назва',

        'users' => 'Користувачі',
        'count' => 'Кіл-ть користувачів',
        'created_at' => 'Створено',
    ],

    'messages' => [
        'create' => 'Роль ":title" успішно створено',
        'edit'   => 'Роль ":title" успішно оновлено',
        'delete' => 'Роль ":title" успішно видалено',
    ],

    'actions' => [
        'create' => 'Додати роль',
        'edit'   => 'Редагувати роль',
        'delete' => 'Видалити роль',
    ],
];
