<?php

return [
    'title' => 'Налаштування',
    'updated' => 'Налаштування збережено',
    'section' => [
        'main' => 'Основні',
        'additional' => 'Додаткові',
        'integrations' => 'Інтеграції',
    ],

    'comments' => [
        'title' => 'Налаштування коментарів',
        'enabled' => 'Дозволити коментарі під публікаціями',
        'auto_approve' => 'Автоматичне схвалення коментарів',
        'filter_words' => 'Заборонені слова',
        'filter_words_hint' => 'Введіть слова, які потрібно блокувати, через кому (наприклад: спам, казино, віагра).',
        'links_policy' => 'Політика щодо посилань у коментарях',
        'links_allow' => 'Дозволити посилання',
        'links_remove' => 'Видаляти посилання',
        'links_reject' => 'Відхиляти коментар із посиланнями',
        'comment_cannot_be_empty' => 'Коментар не може бути порожнім.',
    ],
    'users' => [
        'title' => 'Налаштування користувачів',
        'default_status' => 'Статус за замовчуванням',
        'default_role' => 'Роль за замовчуванням',
        'require_email_verification' => 'Потрібне підтвердження електронної пошти',
    ],
    'site' => [
        'title' => 'Загальні налаштування',
        'name' => 'Назва сайту',
        'description' => 'Опис сайту',
        'keywords' => 'Мета ключові слова',
        'keywords_hint' => 'Введіть ключові слова через кому (наприклад, блог, техно, новини).',
        'favicon' => 'Favicon',
        'timezone' => 'Часовий пояс',

        // Placeholders
        'placeholders' => [
            'name' => 'Введіть назву сайту (наприклад, Моя компанія)',
            'description' => 'Коротко опишіть призначення або зміст сайту',
            'keywords' => 'Введіть ключові слова через кому (наприклад, блог, техно, новини)',
            'favicon' => 'Завантажте невелику іконку (16x16 або 32x32)',
        ],
    ],
    'telegram' => [
        'title' => 'Telegram',
        'enabled' => 'Увімкнути публікацію в Telegram',
        'token' => "Токен бота",
        'chatid' => 'Chat ID',
        'send_without_sound' => 'Надсилати без звуку',
        'template' => 'Шаблон повідомлення',
        'message_limit' => 'Ліміт символів повідомлення',
        'button_text' => 'Текст кнопки',
        'placeholder' => [
            'token' => 'Введіть API токен вашого Telegram-бота (наприклад: 1234567890:AAH1aBcD2EfG3...)',
            'chatid' => 'Введіть ID чату або каналу (наприклад: -1009876543210)',
            'template' => 'Введіть шаблон повідомлення',
            'message_limit' => 'Введіть максимальну кількість символів',
            'button_text' => 'Введіть текст кнопки',
        ]
    ],
];
