<?php

return [
    'title' => 'Користувачі',

    'fields' => [
        'id'         => 'ID',

        'avatar' => 'Аватар',
        'name'       => 'Ім’я',
        'surname'    => 'Прізвище',
        'login'      => 'Логін',
        'email'      => 'Email',

        'password' => 'Пароль',
        'role'       => 'Роль',
        'status'     => 'Статус',
        'verified'   => 'Підтверджено',
        'count'      => 'Кількість публікацій',
        'created_at' => 'Створено',
        'updated_at' => 'Оновлено',
    ],

    'placeholder' => [
        'name' => 'Введіть ваше ім’я',
        'surname' => 'Введіть ваше прізвище',
        'login' => 'Введіть ваш логін',
        'email' => 'Введіть вашу електронну адресу',
        'password' => 'Введіть ваш пароль',

        'job_title' => 'Введіть вашу посаду',
        'address' => 'Введіть вашу адресу',
        'website' => 'Посилання на профіль в соц. мережі.',
        'about_myself' => 'Про себе',

        'github' => 'Посилання на GitHub',
        'linkedin' => 'Посилання на LinkedIn',
    ],

    'messages' => [
        'create' => 'Користувача ":login" успішно створено',
        'edit'   => 'Користувача ":login" успішно оновлено',
        'delete' => 'Користувача ":login" успішно видалено',

         'verified'     => 'Підтверджено',
        'not_verified' => 'Не підтверджено',
    ],

    'actions' => [
        'create' => 'Додати користувача',
        'edit'   => 'Редагувати користувача',
        'delete' => 'Видалити користувача',
    ],    
];
