<?php

return [
    'email' => [
        'required' => 'Поле електронної пошти є обов’язковим.',
        'string' => 'Електронна пошта повинна бути рядком.',
        'email' => 'Введіть коректну адресу електронної пошти.',
        'max' => 'Електронна пошта не повинна перевищувати :max символів.',
        'unique' => 'Користувач з такою електронною поштою вже існує.',
    ],

    'captcha' => [
        'required' => 'Введіть капчу.',
        'incorrect' => 'Неправильна капча.',
    ],

    'password' => [
        'required' => 'Пароль є обов’язковим.',
        'string' => 'Пароль повинен бути рядком.',
        'min' => 'Пароль повинен містити щонайменше :min символів.',
        'max' => 'Пароль не повинен перевищувати :max символів.',
        'confirmed' => 'Паролі не співпадають.',
        'letters' => 'Пароль має містити принаймні одну літеру.',
        'mixed' => 'Пароль має містити велику і малу літери.',
        'numbers' => 'Пароль має містити хоча б одну цифру.',
        'symbols' => 'Пароль має містити хоча б один спеціальний символ.',
        'uncompromised' => 'Цей пароль був скомпрометований. Будь ласка, оберіть інший.',

    ],
    'current_password' => [
        'required' => 'Введіть поточний пароль.',
        'current_password' => 'Поточний пароль введено невірно.',
    ],

    'login' => [
        'required' => 'Логін є обов’язковим.',
        'string' => 'Логін повинен бути рядком.',
        'min' => 'Логін повинен містити щонайменше :min символів.',
        'max' => 'Логін не повинен перевищувати :max символів.',
        'unique' => 'Користувач з таким логіном вже існує.',
        'regex' => 'Логін може містити лише англійські літери, цифри та нижнє підкреслення (_).',
    ],

    'token' => [
        'required' => 'Токен скидання паролю є обов’язковим.',
    ],

    'search' => [
        'string' => 'Пошуковий запит має бути рядком.',
        'min' => 'Пошуковий запит має містити щонайменше :min символів.',
    ],

    'title' => [
        'string' => 'Заголовок має бути рядком.',
    ],

    'content' => [
        'string' => 'Вміст має бути рядком.',
    ],

    'category' => [
        'string' => 'Категорія має бути рядком.',
    ],

    'tags' => [
        'array' => 'Теги мають бути у вигляді масиву.',
    ],

    'tags.*' => [
        'string' => 'Кожен тег має бути рядком.',
    ],

    'author' => [
        'string' => "Ім'я автора має бути рядком.",
    ],

    'sort_by' => [
        'string' => 'Поле сортування має бути рядком.',
        'in' => 'Поле сортування має бути одним з наступних: id, title, created_at, updated_at.',
    ],

    'sort_dir' => [
        'string' => 'Напрямок сортування має бути рядком.',
        'in' => 'Напрямок сортування має бути або "asc", або "desc".',
    ],

    'subject' => [
        'required' => 'Будь ласка, вкажіть тему повідомлення.',
        'string' => 'Тема повинна бути рядком.',
        'max' => 'Тема не повинна перевищувати :max символів.',
    ],

    'message' => [
        'required' => 'Будь ласка, введіть повідомлення.',
        'string' => 'Повідомлення повинно бути рядком.',
        'min' => 'Повідомлення повинно містити щонайменше :min символів.',
        'max' => 'Повідомлення не повинно перевищувати :max символів.',
    ],

    'avatar' => [
        'image' => 'Аватар має бути зображенням (jpg, jpeg, png, webp).',
        'mimes' => 'Аватар повинен бути файлом одного з типів: :values.',
        'max' => 'Розмір аватара не повинен перевищувати :max КБ.',
    ],

    'name' => [
        'required' => "Поле ім’я є обов’язковим.",
        'string' => "Ім’я повинно бути рядком.",
        'max' => "Ім’я не повинно перевищувати :max символів.",
        'regex' => 'Ім’я може містити лише англійські літери.',
    ],

    'surname' => [
        'string' => 'Прізвище повинно бути рядком.',
        'max' => 'Прізвище не повинно перевищувати :max символів.',
        'regex' => 'Прізвище може містити лише англійські літери.',
    ],

    'job_title' => [
        'string' => 'Посада повинна бути рядком.',
        'max' => 'Посада не повинна перевищувати :max символів.',
    ],

    'address' => [
        'string' => 'Адреса повинна бути рядком.',
        'max' => 'Адреса не повинна перевищувати :max символів.',
    ],

    'about_myself' => [
        'string' => 'Розділ “Про себе” повинен бути рядком.',
        'max' => 'Розділ “Про себе” не повинен перевищувати :max символів.',
    ],

    'website' => [
        'url' => 'Формат вебсайту є некоректним.',
        'max' => 'Посилання на вебсайт не повинно перевищувати :max символів.',
        'public_url' => 'Введіть коректне публічне посилання.',
    ],

    'github' => [
        'url' => 'Формат посилання на GitHub є некоректним.',
        'max' => 'Посилання на GitHub не повинно перевищувати :max символів.',
        'github_url' => 'Поле повинно містити дійсне посилання на профіль GitHub.',
    ],

    'linkedin' => [
        'url' => 'Формат посилання на LinkedIn є некоректним.',
        'max' => 'Посилання на LinkedIn не повинно перевищувати :max символів.',
        'linkedin_url' => 'Поле повинно містити дійсне посилання на профіль LinkedIn.',
    ],

    'comment' => [
        'post_id' => [
            'required' => 'Необхідно вказати ID поста.',
            'exists'   => 'Вказаний пост не існує.',
        ],
        'body' => [
            'required' => 'Поле коментаря не може бути пустим.',
            'string'   => 'Поле коментаря повинно бути текстом.',
            'min'      => 'Коментар має містити щонайменше :min символів.',
            'max'      => 'Коментар не може перевищувати :max символів.',
        ],
        'parent_id' => [
            'exists' => 'Вказаний батьківський коментар не існує.',
        ],
    ],
];
