<?php
return [
    'success' => [
        'password_reset_link_sent' => 'Якщо обліковий запис існує, ми надіслали вам посилання для скидання пароля. Перевірте вашу електронну пошту.',
        'account_inactive' => 'Ваш обліковий запис неактивний. Будь ласка, зверніться до технічної підтримки.',
        'register' => 'Користувача успішно зареєстровано. Щоб активувати обліковий запис, підтвердіть свою електронну адресу.',
        'reset' => 'Пароль успішно змінено. Будь ласка, увійдіть до системи.',
        'link_sent' => 'Якщо обліковий запис існує, ми надіслали вам посилання для підтвердження. Перевірте вашу електронну пошту, щоб підтвердити акаунт.',
        'link_generic' => 'Якщо така електронна адреса існує, ми надіслали на неї посилання для підтвердження. Перевірте вхідні повідомлення. Якщо листа немає — перевірте правильність email.',

        'email_already_verified' => 'Електронну адресу вже підтверджено.',
        'email_verified_success' => 'Електронну адресу підтверджено. Тепер ви можете увійти.',
    ],
    'error' => [
        'unexpected_error' => 'Сталася неочікувана помилка. Будь ласка, спробуйте пізніше.',
        'auth_failed' => 'Неправильний email або пароль.',
        'register' => 'Під час створення користувача сталася помилка. Будь ласка, спробуйте пізніше.',
        'reset' => 'Не вдалося скинути пароль. Перевірте правильність токена та електронної адреси.',
        'invalid_or_expired_link' => 'Недійсне або прострочене посилання.',
        'invalid_language' => 'Неприпустима мова.',
    ],
];
