<?php
return [
    'read_more' => 'Читати більше',
    'related_posts' => 'Схожі пости',
    'popular_posts' => 'Популярні пости',
    'top_posts' => 'Топ 5 постів',
    'not_found' => [
        'title' => 'Публікацій не знайдено.',
        'description' => 'За вашим запитом публікацій не знайдено.',
        'return_home' => 'Повернутися на головну сторінку',
    ],
    'comment' =>
    [
        'title' => 'Коментарі',
        'write_comment' => 'Написати коментар',
        'send' => 'Надіслати',
        'placeholder' => 'Ваш коментар...',
        'reply_title' => 'Відповісти',
        'reply_to' => 'Відповідь на коментар',
        'reply_to_cancel' => 'скасувати',
        'comment_added' => 'Коментар додано.',

        'post_id' =>
        [
            'required' => 'Потрібно вказати ідентифікатор публікації.',
            'exists' => 'Вибрана публікація не існує.',
        ],
        'body' =>
        [
            'required' => 'Текст коментаря обовʼязковий.',
            'string' => 'Коментар має бути рядком.',
            'min' => 'Коментар має містити щонайменше :min символів.',
            'max' => 'Коментар не повинен перевищувати :max символів.',
        ],

        'parent_id.' => [
            'exists' => 'Коментар, на який ви відповідаєте, не знайдено'
        ],

        'comments_disabled' => 'Коментування цього поста вимкнено.',
    ],
];
